extends Node

var amount_of_banning_lists = 1

var ban = {
	"banned_ages": [],
	"banned_citizenship": [],
	"banned_names": [],
	"banned_surnames": [],
	"banned_textures": [load("res://Sprites/people/civ_f_001t.webp")]
}

var sexes = ["М", "Ж"]
var first_names_rus_m = [
  "Иван", "Петр", "Алексей", "Игорь", "Марк", "Тарас",
  "Сергей", "Дмитрий", "Андрей", "Михаил", "Николай", "Владимир",
  "Александр", "Павел", "Роман", "Егор", "Артём", "Максим",
  "Кирилл", "Олег", "Виктор", "Григорий", "Фёдор", "Борис",
  "Даниил", "Тимофей", "Степан", "Лев", "Клим"
]

var last_names_rus_m = [
  "Иванов", "Петров", "Попов", "Бульба", "Попель",
  "Смирнов", "Кузнецов", "Соколов", "Лебедев", "Козлов", "Новиков",
  "Морозов", "Волков", "Соловьёв", "Васильев", "Зайцев", "Павлов",
  "Семёнов", "Голубев", "Виноградов", "Богданов", "Воробьёв",
  "Фёдоров", "Михайлов", "Беляев", "Тарасов", "Белов"
]

var first_names_rus_f = [
  "Мария", "Славя", "Ксюша",
  "Анна", "Елена", "Ольга", "Наталья", "Ирина", "Татьяна",
  "Светлана", "Екатерина", "Юлия", "Дарья", "Алина", "Полина",
  "Вера", "Надежда", "Любовь", "Софья", "Валентина", "Галина",
  "Лидия", "Нина", "Оксана", "Виктория", "Елизавета"
]

var last_names_rus_f = [
  "Летова", "Ленина",
  "Смирнова", "Кузнецова", "Соколова", "Лебедева", "Козлова", "Новикова",
  "Морозова", "Волкова", "Соловьёва", "Васильева", "Зайцева", "Павлова",
  "Семёнова", "Голубева", "Виноградова", "Богданова", "Воробьёва",
  "Фёдорова", "Михайлова", "Беляева", "Тарасова", "Белова"
]

var first_names_central_asian_m = [
  "Алишер", "Тимур", "Рустам", "Бахтиёр", "Шохрух",
  "Джахонгир", "Улугбек", "Азамат", "Ерлан", "Нурлан",
  "Айбек", "Бакыт", "Данияр", "Арман", "Санжар",
  "Фарход", "Камол", "Далер", "Фирдавс", "Мердан",
  "Сердар", "Абдулла", "Ислам", "Мурат", "Тахир"
]

var last_names_central_asian_m = [
  "Каримов", "Рахимов", "Исмаилов", "Ахметов", "Сейткалиев",
  "Жумабаев", "Абдуллаев", "Юсупов", "Назаров", "Сафаров",
  "Мирзоев", "Шарипов", "Умаров", "Хасанов", "Бекмуратов",
  "Алиев", "Гафуров", "Давлатов", "Собиров", "Турсунов",
  "Кулиев", "Оразов", "Атаев", "Бердиев", "Сапаров"
]

var first_names_central_asian_f = [
  "Айгуль", "Гульнара", "Динара", "Зарина", "Мадина",
  "Нилуфар", "Шахноза", "Малика", "Дилноза", "Лола",
  "Гульмира", "Асель", "Аида", "Айжан", "Сауле",
  "Жанар", "Ботагоз", "Мээрим", "Айпери", "Наргиза",
  "Фарида", "Мехри", "Гозель", "Лейла", "Амина"
]

var last_names_central_asian_f = [
  "Каримова", "Рахимова", "Исмаилова", "Ахметова", "Сейткалиева",
  "Жумабаева", "Абдуллаева", "Юсупова", "Назарова", "Сафарова",
  "Мирзоева", "Шарипова", "Умарова", "Хасанова", "Бекмуратова",
  "Алиева", "Гафурова", "Давлатова", "Собирова", "Турсунова",
  "Кулиева", "Оразова", "Атаева", "Бердиева", "Сапарова"
]

var first_names_western_m = [
  "Джеймс", "Джон", "Майкл", "Роберт", "Дэвид",
  "Уильям", "Ричард", "Джозеф", "Томас", "Чарльз",
  "Дэниел", "Мэттью", "Энтони", "Марк", "Дональд",
  "Стивен", "Пол", "Эндрю", "Джошуа", "Кевин",
  "Брайан", "Джордж", "Эдвард", "Райан", "Джек"
]

var last_names_western_m = [
  "Смит", "Джонсон", "Уильямс", "Браун", "Джонс",
  "Гарсия", "Миллер", "Дэвис", "Родригес", "Мартинес",
  "Эрнандес", "Лопес", "Гонсалес", "Уилсон", "Андерсон",
  "Томас", "Тейлор", "Мур", "Джексон", "Мартин",
  "Ли", "Перес", "Томпсон", "Уайт", "Харрис"
]

var first_names_western_f = [
  "Мэри", "Патриша", "Дженнифер", "Линда", "Элизабет",
  "Барбара", "Сьюзен", "Джессика", "Сара", "Карен",
  "Нэнси", "Лиза", "Бетти", "Маргарет", "Сандра",
  "Эшли", "Кимберли", "Эмили", "Донна", "Мишель",
  "Кэрол", "Аманда", "Дороти", "Мелисса", "Дебора"
]

var last_names_western_f = [
  "Смит", "Джонсон", "Уильямс", "Браун", "Джонс",
  "Гарсия", "Миллер", "Дэвис", "Родригес", "Мартинес",
  "Эрнандес", "Лопес", "Гонсалес", "Уилсон", "Андерсон",
  "Томас", "Тейлор", "Мур", "Джексон", "Мартин",
  "Ли", "Перес", "Томпсон", "Уайт", "Харрис"
]

var citizenship_types = ["Трикарасье", "Новкарасье", "Чегория", "Стромыния", "Сокологора", "Теркастан", "Кашингтон", "Вернандт"]

var banned_citizenships = [ ]
var banned_people = []

func _ready() -> void:
	banned_citizenships.append(citizenship_types.pick_random())
	banned_people.append(Personality.new())

#func update_ban_lists():
	#var amount = 0
	#for k in ban.keys():
		#if len(ban[k]) > 0:
			#amount += 1
	#amount_of_banning_lists = amount
#
#
#func get_ban_lists():
	#var ban_list = []
	#for k in ban.keys():
		#if len(ban[k]) > 0:
			#ban_list.append(k)
	#return ban_list
#
#
#func add_ban(p_name, massive: Array):
	#massive.append(p_name)
	#update_ban_lists()
#
#
#func del_ban(p_name, massive: Array):
	#var _deleting_item
	#for i in range(len(massive)):
		#if massive[i] == p_name:
			#_deleting_item = massive[i]
	#massive.remove_at(_deleting_item)
	#update_ban_lists()
